mikeakohn/naken_asm/include/msp430_old/msp430g2553.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;
;;;  msp430g2553 include file
;;;
;;;  hacked from the msp430-gcc header file with a series of regex replaces
;;;  and a little bit of hand tweaking.
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;;;
;;; STANDARD BITS
;;;

BIT0		equ	0x0001	
BIT1		equ	0x0002	
BIT2		equ	0x0004	
BIT3		equ	0x0008	
BIT4		equ	0x0010	
BIT5		equ	0x0020	
BIT6		equ	0x0040	
BIT7		equ	0x0080	
BIT8		equ	0x0100	
BIT9		equ	0x0200	
BITA		equ	0x0400	
BITB		equ	0x0800	
BITC		equ	0x1000	
BITD		equ	0x2000	
BITE		equ	0x4000	
BITF		equ	0x8000	

;;;
;;; STATUS REGISTER BITS
;;;

C		equ	0x0001	
Z		equ	0x0002	
N		equ	0x0004	
V		equ	0x0100	
GIE		equ	0x0008	
CPUOFF		equ	0x0010	
OSCOFF		equ	0x0020	
SCG0		equ	0x0040	
SCG1		equ	0x0080	

;;;
;;; Low Power Modes coded with Bits 4-7 in SR 
;;;

LPM0		equ	CPUOFF	
LPM1		equ	SCG0+CPUOFF	
LPM2		equ	SCG1+CPUOFF	
LPM3		equ	SCG1+SCG0+CPUOFF	
LPM4		equ	SCG1+SCG0+OSCOFF+CPUOFF	


;;;
;;; SPECIAL FUNCTION REGISTER ADDRESSES + CONTROL BITS
;;;

IE1		equ	0x0000		; Interrupt Enable 1 

WDTIE		equ	0x01		; Watchdog Interrupt Enable 
OFIE		equ	0x02		; Osc. Fault  Interrupt Enable 
NMIIE		equ	0x10		; NMI Interrupt Enable 
ACCVIE		equ	0x20		; Flash Access Violation Interrupt Enable 

IFG1		equ	0x0002		; Interrupt Flag 1 

WDTIFG		equ	0x01		; Watchdog Interrupt Flag 
OFIFG		equ	0x02		; Osc. Fault Interrupt Flag 
PORIFG		equ	0x04		; Power On Interrupt Flag 
RSTIFG		equ	0x08		; Reset Interrupt Flag 
NMIIFG		equ	0x10		; NMI Interrupt Flag 

IE2		equ	0x0001		; Interrupt Enable 2 
UC0IE		equ	IE2	
UCA0RXIE	equ	0x01	
UCA0TXIE	equ	0x02	
UCB0RXIE	equ	0x04	
UCB0TXIE	equ	0x08	

IFG2		equ	0x0003		; Interrupt Flag 2 
UC0IFG		equ	IFG2	
UCA0RXIFG	equ	0x01	
UCA0TXIFG	equ	0x02	
UCB0RXIFG	equ	0x04	
UCB0TXIFG	equ	0x08	


;;;
;;; ADC10
;;;

#define __MSP430_HAS_ADC10__		; Definition to show that Module is available 

ADC10DTC0	equ	0x0048		; ADC10 Data Transfer Control 0 
ADC10DTC1	equ	0x0049		; ADC10 Data Transfer Control 1 
ADC10AE0	equ	0x004A		; ADC10 Analog Enable 0 
ADC10CTL0	equ	0x01B0		; ADC10 Control 0 
ADC10CTL1	equ	0x01B2		; ADC10 Control 1 
ADC10MEM	equ	0x01B4		; ADC10 Memory 
ADC10SA		equ	0x01BC		; ADC10 Data Transfer Start Address 

; ADC10CTL0 
ADC10SC		equ	0x001		; ADC10 Start Conversion 
ENC		equ	0x002		; ADC10 Enable Conversion 
ADC10IFG	equ	0x004		; ADC10 Interrupt Flag 
ADC10IE		equ	0x008		; ADC10 Interrupt Enalbe 
ADC10ON		equ	0x010		; ADC10 On/Enable 
REFON		equ	0x020		; ADC10 Reference on 
REF2_5V		equ	0x040		; ADC10 Ref 0:1.5V / 1:2.5V 
MSC		equ	0x080		; ADC10 Multiple SampleConversion 
REFBURST	equ	0x100		; ADC10 Reference Burst Mode 
REFOUT		equ	0x200		; ADC10 Enalbe output of Ref. 
ADC10SR		equ	0x400		; ADC10 Sampling Rate 0:200ksps / 1:50ksps 
ADC10SHT0	equ	0x800		; ADC10 Sample Hold Select Bit: 0 
ADC10SHT1	equ	0x1000		; ADC10 Sample Hold Select Bit: 1 
SREF0		equ	0x2000		; ADC10 Reference Select Bit: 0 
SREF1		equ	0x4000		; ADC10 Reference Select Bit: 1 
SREF2		equ	0x8000		; ADC10 Reference Select Bit: 2 
ADC10SHT_0	equ	0x0000		; 4 x ADC10CLKs 
ADC10SHT_1	equ	0x0800		; 8 x ADC10CLKs 
ADC10SHT_2	equ	0x1000		; 16 x ADC10CLKs 
ADC10SHT_3	equ	0x1800		; 64 x ADC10CLKs 

SREF_0		equ	0x0000		; VR+ = AVCC and VR- = AVSS 
SREF_1		equ	0x2000		; VR+ = VREF+ and VR- = AVSS 
SREF_2		equ	0x4000		; VR+ = VEREF+ and VR- = AVSS 
SREF_3		equ	0x6000		; VR+ = VEREF+ and VR- = AVSS 
SREF_4		equ	0x8000		; VR+ = AVCC and VR- = VREF-/VEREF- 
SREF_5		equ	0xA000		; VR+ = VREF+ and VR- = VREF-/VEREF- 
SREF_6		equ	0xC000		; VR+ = VEREF+ and VR- = VREF-/VEREF- 
SREF_7		equ	0xE000		; VR+ = VEREF+ and VR- = VREF-/VEREF- 

; ADC10CTL1 
ADC10BUSY	equ	0x0001		; ADC10 BUSY 
CONSEQ0		equ	0x0002		; ADC10 Conversion Sequence Select 0 
CONSEQ1		equ	0x0004		; ADC10 Conversion Sequence Select 1 
ADC10SSEL0	equ	0x0008		; ADC10 Clock Source Select Bit: 0 
ADC10SSEL1	equ	0x0010		; ADC10 Clock Source Select Bit: 1 
ADC10DIV0	equ	0x0020		; ADC10 Clock Divider Select Bit: 0 
ADC10DIV1	equ	0x0040		; ADC10 Clock Divider Select Bit: 1 
ADC10DIV2	equ	0x0080		; ADC10 Clock Divider Select Bit: 2 
ISSH		equ	0x0100		; ADC10 Invert Sample Hold Signal 
ADC10DF		equ	0x0200		; ADC10 Data Format 0:binary 1:2's complement 
SHS0		equ	0x0400		; ADC10 Sample/Hold Source Bit: 0 
SHS1		equ	0x0800		; ADC10 Sample/Hold Source Bit: 1 
INCH0		equ	0x1000		; ADC10 Input Channel Select Bit: 0 
INCH1		equ	0x2000		; ADC10 Input Channel Select Bit: 1 
INCH2		equ	0x4000		; ADC10 Input Channel Select Bit: 2 
INCH3		equ	0x8000		; ADC10 Input Channel Select Bit: 3 

CONSEQ_0	equ	0x0000		; Single channel single conversion 
CONSEQ_1	equ	0x0002		; Sequence of channels 
CONSEQ_2	equ	0x0004		; Repeat single channel 
CONSEQ_3	equ	0x0006		; Repeat sequence of channels 

ADC10SSEL_0	equ	0x0000		; ADC10OSC 
ADC10SSEL_1	equ	0x0008		; ACLK 
ADC10SSEL_2	equ	0x0010		; MCLK 
ADC10SSEL_3	equ	0x0018		; SMCLK 

ADC10DIV_0	equ	0x0000		; ADC10 Clock Divider Select 0 
ADC10DIV_1	equ	0x0020		; ADC10 Clock Divider Select 1 
ADC10DIV_2	equ	0x0040		; ADC10 Clock Divider Select 2 
ADC10DIV_3	equ	0x0060		; ADC10 Clock Divider Select 3 
ADC10DIV_4	equ	0x0080		; ADC10 Clock Divider Select 4 
ADC10DIV_5	equ	0x00A0		; ADC10 Clock Divider Select 5 
ADC10DIV_6	equ	0x00C0		; ADC10 Clock Divider Select 6 
ADC10DIV_7	equ	0x00E0		; ADC10 Clock Divider Select 7 

SHS_0		equ	0x0000		; ADC10SC 
SHS_1		equ	0x0400		; TA3 OUT1 
SHS_2		equ	0x0800		; TA3 OUT0 
SHS_3		equ	0x0C00		; TA3 OUT2 

INCH_0		equ	0x0000		; Selects Channel 0 
INCH_1		equ	0x1000		; Selects Channel 1 
INCH_2		equ	0x2000		; Selects Channel 2 
INCH_3		equ	0x3000		; Selects Channel 3 
INCH_4		equ	0x4000		; Selects Channel 4 
INCH_5		equ	0x5000		; Selects Channel 5 
INCH_6		equ	0x6000		; Selects Channel 6 
INCH_7		equ	0x7000		; Selects Channel 7 
INCH_8		equ	0x8000		; Selects Channel 8 
INCH_9		equ	0x9000		; Selects Channel 9 
INCH_10		equ	0xA000		; Selects Channel 10 
INCH_11		equ	0xB000		; Selects Channel 11 
INCH_12		equ	0xC000		; Selects Channel 12 
INCH_13		equ	0xD000		; Selects Channel 13 
INCH_14		equ	0xE000		; Selects Channel 14 
INCH_15		equ	0xF000		; Selects Channel 15 

; ADC10DTC0 
ADC10FETCH	equ	0x001		; This bit should normally be reset 
ADC10B1		equ	0x002		; ADC10 block one 
ADC10CT		equ	0x004		; ADC10 continuous transfer 
ADC10TB		equ	0x008		; ADC10 two-block mode 
ADC10DISABLE	equ	0x000		; ADC10DTC1 

;;;
;;; Basic Clock Module
;;;

#define __MSP430_HAS_BC2__		; Definition to show that Module is available 

DCOCTL		equ	0x0056		; DCO Clock Frequency Control 
BCSCTL1		equ	0x0057		; Basic Clock System Control 1 
BCSCTL2		equ	0x0058		; Basic Clock System Control 2 
BCSCTL3		equ	0x0053		; Basic Clock System Control 3 

