mikeakohn/naken_asm/include/msp430_old/msp430g2553.inc
MOD0		equ	0x01		; Modulation Bit 0 
MOD1		equ	0x02		; Modulation Bit 1 
MOD2		equ	0x04		; Modulation Bit 2 
MOD3		equ	0x08		; Modulation Bit 3 
MOD4		equ	0x10		; Modulation Bit 4 
DCO0		equ	0x20		; DCO Select Bit 0 
DCO1		equ	0x40		; DCO Select Bit 1 
DCO2		equ	0x80		; DCO Select Bit 2 

RSEL0		equ	0x01		; Range Select Bit 0 
RSEL1		equ	0x02		; Range Select Bit 1 
RSEL2		equ	0x04		; Range Select Bit 2 
RSEL3		equ	0x08		; Range Select Bit 3 
DIVA0		equ	0x10		; ACLK Divider 0 
DIVA1		equ	0x20		; ACLK Divider 1 
XTS		equ	0x40		; LFXTCLK 0:Low Freq. / 1: High Freq. 
XT2OFF		equ	0x80		; Enable XT2CLK 

DIVA_0		equ	0x00		; ACLK Divider 0: /1 
DIVA_1		equ	0x10		; ACLK Divider 1: /2 
DIVA_2		equ	0x20		; ACLK Divider 2: /4 
DIVA_3		equ	0x30		; ACLK Divider 3: /8 

DIVS0		equ	0x02		; SMCLK Divider 0 
DIVS1		equ	0x04		; SMCLK Divider 1 
SELS		equ	0x08		; SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK 
DIVM0		equ	0x10		; MCLK Divider 0 
DIVM1		equ	0x20		; MCLK Divider 1 
SELM0		equ	0x40		; MCLK Source Select 0 
SELM1		equ	0x80		; MCLK Source Select 1 

DIVS_0		equ	0x00		; SMCLK Divider 0: /1 
DIVS_1		equ	0x02		; SMCLK Divider 1: /2 
DIVS_2		equ	0x04		; SMCLK Divider 2: /4 
DIVS_3		equ	0x06		; SMCLK Divider 3: /8 

DIVM_0		equ	0x00		; MCLK Divider 0: /1 
DIVM_1		equ	0x10		; MCLK Divider 1: /2 
DIVM_2		equ	0x20		; MCLK Divider 2: /4 
DIVM_3		equ	0x30		; MCLK Divider 3: /8 

SELM_0		equ	0x00		; MCLK Source Select 0: DCOCLK 
SELM_1		equ	0x40		; MCLK Source Select 1: DCOCLK 
SELM_2		equ	0x80		; MCLK Source Select 2: XT2CLK/LFXTCLK 
SELM_3		equ	0xC0		; MCLK Source Select 3: LFXTCLK 
										   
LFXT1OF		equ	0x01		; Low/high Frequency Oscillator Fault Flag 
XT2OF		equ	0x02		; High frequency oscillator 2 fault flag 
XCAP0		equ	0x04		; XIN/XOUT Cap 0 
XCAP1		equ	0x08		; XIN/XOUT Cap 1 
LFXT1S0		equ	0x10		; Mode 0 for LFXT1 XTS = 0 
LFXT1S1		equ	0x20		; Mode 1 for LFXT1 XTS = 0 
XT2S0		equ	0x40		; Mode 0 for XT2 
XT2S1		equ	0x80		; Mode 1 for XT2 

XCAP_0		equ	0x00		; XIN/XOUT Cap : 0 pF 
XCAP_1		equ	0x04		; XIN/XOUT Cap : 6 pF 
XCAP_2		equ	0x08		; XIN/XOUT Cap : 10 pF 
XCAP_3		equ	0x0C		; XIN/XOUT Cap : 12.5 pF 

LFXT1S_0	equ	0x00		; Mode 0 for LFXT1 : Normal operation 
LFXT1S_1	equ	0x10		; Mode 1 for LFXT1 : Reserved 
LFXT1S_2	equ	0x20		; Mode 2 for LFXT1 : VLO 
LFXT1S_3	equ	0x30		; Mode 3 for LFXT1 : Digital input signal 

XT2S_0		equ	0x00		; Mode 0 for XT2 : 0.4 - 1 MHz 
XT2S_1		equ	0x40		; Mode 1 for XT2 : 1 - 4 MHz 
XT2S_2		equ	0x80		; Mode 2 for XT2 : 2 - 16 MHz 
XT2S_3		equ	0xC0		; Mode 3 for XT2 : Digital input signal 

;;;
;;; Comparator A
;;;

#define __MSP430_HAS_CAPLUS__		; Definition to show that Module is available 

CACTL1		equ	0x0059		; Comparator A Control 1 
CACTL2		equ	0x005A		; Comparator A Control 2 
CAPD		equ	0x005B		; Comparator A Port Disable 

CAIFG		equ	0x01		; Comp. A Interrupt Flag 
CAIE		equ	0x02		; Comp. A Interrupt Enable 
CAIES		equ	0x04		; Comp. A Int. Edge Select: 0:rising / 1:falling 
CAON		equ	0x08		; Comp. A enable 
CAREF0		equ	0x10		; Comp. A Internal Reference Select 0 
CAREF1		equ	0x20		; Comp. A Internal Reference Select 1 
CARSEL		equ	0x40		; Comp. A Internal Reference Enable 
CAEX		equ	0x80		; Comp. A Exchange Inputs 

CAREF_0		equ	0x00		; Comp. A Int. Ref. Select 0 : Off 
CAREF_1		equ	0x10		; Comp. A Int. Ref. Select 1 : 0.25*Vcc 
CAREF_2		equ	0x20		; Comp. A Int. Ref. Select 2 : 0.5*Vcc 
CAREF_3		equ	0x30		; Comp. A Int. Ref. Select 3 : Vt

CAOUT		equ	0x01		; Comp. A Output 
CAF		equ	0x02		; Comp. A Enable Output Filter 
P2CA0		equ	0x04		; Comp. A +Terminal Multiplexer 
P2CA1		equ	0x08		; Comp. A -Terminal Multiplexer 
P2CA2		equ	0x10		; Comp. A -Terminal Multiplexer 
P2CA3		equ	0x20		; Comp. A -Terminal Multiplexer 
P2CA4		equ	0x40		; Comp. A +Terminal Multiplexer 
CASHORT		equ	0x80		; Comp. A Short + and - Terminals 

CAPD0		equ	0x01		; Comp. A Disable Input Buffer of Port Register .0 
CAPD1		equ	0x02		; Comp. A Disable Input Buffer of Port Register .1 
CAPD2		equ	0x04		; Comp. A Disable Input Buffer of Port Register .2 
CAPD3		equ	0x08		; Comp. A Disable Input Buffer of Port Register .3 
CAPD4		equ	0x10		; Comp. A Disable Input Buffer of Port Register .4 
CAPD5		equ	0x20		; Comp. A Disable Input Buffer of Port Register .5 
CAPD6		equ	0x40		; Comp. A Disable Input Buffer of Port Register .6 
CAPD7		equ	0x80		; Comp. A Disable Input Buffer of Port Register .7 

;;;
;;; Flash Memory
;;;

#define __MSP430_HAS_FLASH2__		; Definition to show that Module is available 

FCTL1		equ	0x0128		; FLASH Control 1 
FCTL2		equ	0x012A		; FLASH Control 2 
FCTL3		equ	0x012C		; FLASH Control 3 

FRKEY		equ	0x9600		; Flash key returned by read 
FWKEY		equ	0xA500		; Flash key for write 
FXKEY		equ	0x3300		; for use with XOR instruction 

ERASE		equ	0x0002		; Enable bit for Flash segment erase 
MERAS		equ	0x0004		; Enable bit for Flash mass erase 
WRT		equ	0x0040		; Enable bit for Flash write 
BLKWRT		equ	0x0080		; Enable bit for Flash segment write 
SEGWRT		equ	0x0080		; old definition -- Enable bit for Flash segment write 

FN0		equ	0x0001		; Divide Flash clock by 1 to 64 using FN0 to FN5 according to: 
FN1		equ	0x0002		;  32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1 
FN2		equ	0x0004	
FN3		equ	0x0008	
FN4		equ	0x0010	
FN5		equ	0x0020	
FSSEL0		equ	0x0040		; Flash clock select 0 -- to distinguish from USART SSELx 
FSSEL1		equ	0x0080		; Flash clock select 1 

FSSEL_0		equ	0x0000		; Flash clock select: 0 - ACLK 
FSSEL_1		equ	0x0040		; Flash clock select: 1 - MCLK 
FSSEL_2		equ	0x0080		; Flash clock select: 2 - SMCLK 
FSSEL_3		equ	0x00C0		; Flash clock select: 3 - SMCLK 

BUSY		equ	0x0001		; Flash busy: 1 
KEYV		equ	0x0002		; Flash Key violation flag 
ACCVIFG		equ	0x0004		; Flash Access violation flag 
WAIT		equ	0x0008		; Wait flag for segment write 
LOCK		equ	0x0010		; Lock bit: 1 - Flash is locked read only 
EMEX		equ	0x0020		; Flash Emergency Exit 
LOCKA		equ	0x0040		; Segment A Lock bit: read = 1 - Segment is locked read only 
FAIL		equ	0x0080		; Last Program or Erase failed 

;;;
;;; DIGITAL I/O Port1/2 Pull up / Pull down Resistors
;;;

#define __MSP430_HAS_PORT1_R__		; Definition to show that Module is available 
#define __MSP430_HAS_PORT2_R__		; Definition to show that Module is available 

P1IN		equ	0x0020		; Port 1 Input 
P1OUT		equ	0x0021		; Port 1 Output 
P1DIR		equ	0x0022		; Port 1 Direction 
P1IFG		equ	0x0023		; Port 1 Interrupt Flag 
P1IES		equ	0x0024		; Port 1 Interrupt Edge Select 
P1IE		equ	0x0025		; Port 1 Interrupt Enable 
P1SEL		equ	0x0026		; Port 1 Selection 
P1SEL2		equ	0x0041		; Port 1 Selection 2 
P1REN		equ	0x0027		; Port 1 Resistor Enable 

P2IN		equ	0x0028		; Port 2 Input 
P2OUT		equ	0x0029		; Port 2 Output 
P2DIR		equ	0x002A		; Port 2 Direction 
P2IFG		equ	0x002B		; Port 2 Interrupt Flag 
P2IES		equ	0x002C		; Port 2 Interrupt Edge Select 
P2IE		equ	0x002D		; Port 2 Interrupt Enable 
P2SEL		equ	0x002E		; Port 2 Selection 
P2SEL2		equ	0x0042		; Port 2 Selection 2 
P2REN		equ	0x002F		; Port 2 Resistor Enable 

;;;
;;; DIGITAL I/O Port3 Pull up / Pull down Resistors
;;;

#define __MSP430_HAS_PORT3_R__		; Definition to show that Module is available 

P3IN		equ	0x0018		; Port 3 Input 
P3OUT		equ	0x0019		; Port 3 Output 
P3DIR		equ	0x001A		; Port 3 Direction 
P3SEL		equ	0x001B		; Port 3 Selection 
P3SEL2		equ	0x0043		; Port 3 Selection 2 
P3REN		equ	0x0010		; Port 3 Resistor Enable 

;;;
;;; Timer0_A3
;;;

#define __MSP430_HAS_TA3__		; Definition to show that Module is available 

TA0IV		equ	0x012E		; Timer0_A3 Interrupt Vector Word 
TA0CTL		equ	0x0160		; Timer0_A3 Control 
TA0CCTL0	equ	0x0162		; Timer0_A3 Capture/Compare Control 0 
TA0CCTL1	equ	0x0164		; Timer0_A3 Capture/Compare Control 1 
TA0CCTL2	equ	0x0166		; Timer0_A3 Capture/Compare Control 2 
TA0R		equ	0x0170		; Timer0_A3 
TA0CCR0		equ	0x0172		; Timer0_A3 Capture/Compare 0 
TA0CCR1		equ	0x0174		; Timer0_A3 Capture/Compare 1 
TA0CCR2		equ	0x0176		; Timer0_A3 Capture/Compare 2 

; Alternate register names 
TAIV		equ	TA0IV		; Timer A Interrupt Vector Word 
TACTL		equ	TA0CTL		; Timer A Control 
TACCTL0		equ	TA0CCTL0	; Timer A Capture/Compare Control 0 
TACCTL1		equ	TA0CCTL1	; Timer A Capture/Compare Control 1 
TACCTL2		equ	TA0CCTL2	; Timer A Capture/Compare Control 2 
TAR		equ	TA0R		; Timer A 
TACCR0		equ	TA0CCR0		; Timer A Capture/Compare 0 
TACCR1		equ	TA0CCR1		; Timer A Capture/Compare 1 
TACCR2		equ	TA0CCR2		; Timer A Capture/Compare 2 

; Alternate register names 2 
CCTL0		equ	TACCTL0		; Timer A Capture/Compare Control 0 
CCTL1		equ	TACCTL1		; Timer A Capture/Compare Control 1 
CCTL2		equ	TACCTL2		; Timer A Capture/Compare Control 2 
CCR0		equ	TACCR0		; Timer A Capture/Compare 0 
CCR1		equ	TACCR1		; Timer A Capture/Compare 1 
CCR2		equ	TACCR2		; Timer A Capture/Compare 2 

TASSEL1		equ	0x0200		; Timer A clock source select 0 
TASSEL0		equ	0x0100		; Timer A clock source select 1 
ID1		equ	0x0080		; Timer A clock input divider 1 
ID0		equ	0x0040		; Timer A clock input divider 0 
MC1		equ	0x0020		; Timer A mode control 1 
MC0		equ	0x0010		; Timer A mode control 0 
TACLR		equ	0x0004		; Timer A counter clear 
TAIE		equ	0x0002		; Timer A counter interrupt enable 
TAIFG		equ	0x0001		; Timer A counter interrupt flag 

MC_0		equ	0x0000		; Timer A mode control: 0 - Stop 
MC_1		equ	0x0010		; Timer A mode control: 1 - Up to CCR0 
MC_2		equ	0x0020		; Timer A mode control: 2 - Continous up 
MC_3		equ	0x0030		; Timer A mode control: 3 - Up/Down 
ID_0		equ	0x0000		; Timer A input divider: 0 - /1 
ID_1		equ	0x0040		; Timer A input divider: 1 - /2 
ID_2		equ	0x0080		; Timer A input divider: 2 - /4 
ID_3		equ	0x00C0		; Timer A input divider: 3 - /8 
TASSEL_0	equ	0x0000		; Timer A clock source select: 0 - TACLK 
TASSEL_1	equ	0x0100		; Timer A clock source select: 1 - ACLK	 
TASSEL_2	equ	0x0200		; Timer A clock source select: 2 - SMCLK 
TASSEL_3	equ	0x0300		; Timer A clock source select: 3 - INCLK 

CM1		equ	0x8000		; Capture mode 1 
CM0		equ	0x4000		; Capture mode 0 
CCIS1		equ	0x2000		; Capture input select 1 
CCIS0		equ	0x1000		; Capture input select 0 
SCS		equ	0x0800		; Capture sychronize 
SCCI		equ	0x0400		; Latched capture signal read 
CAP		equ	0x0100		; Capture mode: 1 /Compare mode : 0 
OUTMOD2		equ	0x0080		; Output mode 2 
OUTMOD1		equ	0x0040		; Output mode 1 
OUTMOD0		equ	0x0020		; Output mode 0 
CCIE		equ	0x0010		; Capture/compare interrupt enable 
CCI		equ	0x0008		; Capture input signal read 
OUT		equ	0x0004		; PWM Output signal if output mode 0 
COV		equ	0x0002		; Capture/compare overflow flag 
CCIFG		equ	0x0001		; Capture/compare interrupt flag 

