mikeakohn/naken_asm/include/msp430_old/msp430g2553.inc
OUTMOD_0	equ	0x0000		; PWM output mode: 0 - output only 
OUTMOD_1	equ	0x0020		; PWM output mode: 1 - set 
OUTMOD_2	equ	0x0040		; PWM output mode: 2 - PWM toggle/reset 
OUTMOD_3	equ	0x0060		; PWM output mode: 3 - PWM set/reset 
OUTMOD_4	equ	0x0080		; PWM output mode: 4 - toggle 
OUTMOD_5	equ	0x00A0		; PWM output mode: 5 - Reset 
OUTMOD_6	equ	0x00C0		; PWM output mode: 6 - PWM toggle/set 
OUTMOD_7	equ	0x00E0		; PWM output mode: 7 - PWM reset/set 
CCIS_0		equ	0x0000		; Capture input select: 0 - CCIxA 
CCIS_1		equ	0x1000		; Capture input select: 1 - CCIxB 
CCIS_2		equ	0x2000		; Capture input select: 2 - GND 
CCIS_3		equ	0x3000		; Capture input select: 3 - Vcc 
CM_0		equ	0x0000		; Capture mode: 0 - disabled 
CM_1		equ	0x4000		; Capture mode: 1 - pos. edge 
CM_2		equ	0x8000		; Capture mode: 1 - neg. edge 
CM_3		equ	0xC000		; Capture mode: 1 - both edges 

; T0_A3IV Definitions 
TA0IV_NONE	equ	0x0000		; No Interrupt pending 
TA0IV_TACCR1	equ	0x0002		; TA0CCR1_CCIFG 
TA0IV_TACCR2	equ	0x0004		; TA0CCR2_CCIFG 
TA0IV_6		equ	0x0006		; Reserved 
TA0IV_8		equ	0x0008		; Reserved 
TA0IV_TAIFG	equ	0x000A		; TA0IFG 

;;;
;;; Timer1_A3
;;;

#define __MSP430_HAS_T1A3__		; Definition to show that Module is available 

TA1IV		equ	0x011E		; Timer1_A3 Interrupt Vector Word 
TA1CTL		equ	0x0180		; Timer1_A3 Control 
TA1CCTL0	equ	0x0182		; Timer1_A3 Capture/Compare Control 0 
TA1CCTL1	equ	0x0184		; Timer1_A3 Capture/Compare Control 1 
TA1CCTL2	equ	0x0186		; Timer1_A3 Capture/Compare Control 2 
TA1R		equ	0x0190		; Timer1_A3 
TA1CCR0		equ	0x0192		; Timer1_A3 Capture/Compare 0 
TA1CCR1		equ	0x0194		; Timer1_A3 Capture/Compare 1 
TA1CCR2		equ	0x0196		; Timer1_A3 Capture/Compare 2 

; Bits are already defined within the Timer0_Ax 

; T1_A3IV Definitions 
TA1IV_NONE	equ	0x0000		; No Interrupt pending 
TA1IV_TACCR1	equ	0x0002		; TA1CCR1_CCIFG 
TA1IV_TACCR2	equ	0x0004		; TA1CCR2_CCIFG 
TA1IV_TAIFG	equ	0x000A		; TA1IFG 

;;;
;;; USCI
;;;

#define __MSP430_HAS_USCI__		; Definition to show that Module is available 

UCA0CTL0	equ	0x0060		; USCI A0 Control Register 0 
UCA0CTL1	equ	0x0061		; USCI A0 Control Register 1 
UCA0BR0		equ	0x0062		; USCI A0 Baud Rate 0 
UCA0BR1		equ	0x0063		; USCI A0 Baud Rate 1 
UCA0MCTL	equ	0x0064		; USCI A0 Modulation Control 
UCA0STAT	equ	0x0065		; USCI A0 Status Register 
UCA0RXBUF	equ	0x0066		; USCI A0 Receive Buffer 
UCA0TXBUF	equ	0x0067		; USCI A0 Transmit Buffer 
UCA0ABCTL	equ	0x005D		; USCI A0 LIN Control 
UCA0IRTCTL	equ	0x005E		; USCI A0 IrDA Transmit Control 
UCA0IRRCTL	equ	0x005F		; USCI A0 IrDA Receive Control 


UCB0CTL0	equ	0x0068		; USCI B0 Control Register 0 
UCB0CTL1	equ	0x0069		; USCI B0 Control Register 1 
UCB0BR0		equ	0x006A		; USCI B0 Baud Rate 0 
UCB0BR1		equ	0x006B		; USCI B0 Baud Rate 1 
UCB0I2CIE	equ	0x006C		; USCI B0 I2C Interrupt Enable Register 
UCB0STAT	equ	0x006D		; USCI B0 Status Register 
UCB0RXBUF	equ	0x006E		; USCI B0 Receive Buffer 
UCB0TXBUF	equ	0x006F		; USCI B0 Transmit Buffer 
UCB0I2COA	equ	0x0118		; USCI B0 I2C Own Address 
UCB0I2CSA	equ	0x011A		; USCI B0 I2C Slave Address 


; UART-Mode Bits
UCPEN		equ	0x80		; Async. Mode: Parity enable 
UCPAR		equ	0x40		; Async. Mode: Parity	  0:odd / 1:even 
UCMSB		equ	0x20		; Async. Mode: MSB first  0:LSB / 1:MSB 
UC7BIT		equ	0x10		; Async. Mode: Data Bits  0:8-bits / 1:7-bits 
UCSPB		equ	0x08		; Async. Mode: Stop Bits  0:one / 1: two 
UCMODE1		equ	0x04		; Async. Mode: USCI Mode 1 
UCMODE0		equ	0x02		; Async. Mode: USCI Mode 0 
UCSYNC		equ	0x01		; Sync-Mode  0:UART-Mode / 1:SPI-Mode 

; SPI-Mode Bits
UCCKPH		equ	0x80		; Sync. Mode: Clock Phase 
UCCKPL		equ	0x40		; Sync. Mode: Clock Polarity 
UCMST		equ	0x08		; Sync. Mode: Master Select 

; I2C-Mode Bits
UCA10		equ	0x80		; 10-bit Address Mode 
UCSLA10		equ	0x40		; 10-bit Slave Address Mode 
UCMM		equ	0x20		; Multi-Master Environment 
;			0x10		; reserved 
UCMODE_0	equ	0x00		; Sync. Mode: USCI Mode: 0 
UCMODE_1	equ	0x02		; Sync. Mode: USCI Mode: 1 
UCMODE_2	equ	0x04		; Sync. Mode: USCI Mode: 2 
UCMODE_3	equ	0x06		; Sync. Mode: USCI Mode: 3 

; UART-Mode Bits
UCSSEL1		equ	0x80		; USCI 0 Clock Source Select 1 
UCSSEL0		equ	0x40		; USCI 0 Clock Source Select 0 
UCRXEIE		equ	0x20		; RX Error interrupt enable 
UCBRKIE		equ	0x10		; Break interrupt enable 
UCDORM		equ	0x08		; Dormant Sleep Mode 
UCTXADDR	equ	0x04		; Send next Data as Address 
UCTXBRK		equ	0x02		; Send next Data as Break 
UCSWRST		equ	0x01		; USCI Software Reset 

; SPI-Mode Bits
;			0x20		; reserved 
;			0x10		; reserved 
;			0x08		; reserved 
;			0x04		; reserved 
;			0x02		; reserved 

; I2C-Mode Bits
;			0x20		; reserved 
UCTR		equ	0x10		; Transmit/Receive Select/Flag 
UCTXNACK	equ	0x08		; Transmit NACK 
UCTXSTP		equ	0x04		; Transmit STOP 
UCTXSTT		equ	0x02		; Transmit START 
UCSSEL_0	equ	0x00		; USCI 0 Clock Source: 0 
UCSSEL_1	equ	0x40		; USCI 0 Clock Source: 1 
UCSSEL_2	equ	0x80		; USCI 0 Clock Source: 2 
UCSSEL_3	equ	0xC0		; USCI 0 Clock Source: 3 

UCBRF3		equ	0x80		; USCI First Stage Modulation Select 3 
UCBRF2		equ	0x40		; USCI First Stage Modulation Select 2 
UCBRF1		equ	0x20		; USCI First Stage Modulation Select 1 
UCBRF0		equ	0x10		; USCI First Stage Modulation Select 0 
UCBRS2		equ	0x08		; USCI Second Stage Modulation Select 2 
UCBRS1		equ	0x04		; USCI Second Stage Modulation Select 1 
UCBRS0		equ	0x02		; USCI Second Stage Modulation Select 0 
UCOS16		equ	0x01		; USCI 16-times Oversampling enable 

UCBRF_0		equ	0x00		; USCI First Stage Modulation: 0 
UCBRF_1		equ	0x10		; USCI First Stage Modulation: 1 
UCBRF_2		equ	0x20		; USCI First Stage Modulation: 2 
UCBRF_3		equ	0x30		; USCI First Stage Modulation: 3 
UCBRF_4		equ	0x40		; USCI First Stage Modulation: 4 
UCBRF_5		equ	0x50		; USCI First Stage Modulation: 5 
UCBRF_6		equ	0x60		; USCI First Stage Modulation: 6 
UCBRF_7		equ	0x70		; USCI First Stage Modulation: 7 
UCBRF_8		equ	0x80		; USCI First Stage Modulation: 8 
UCBRF_9		equ	0x90		; USCI First Stage Modulation: 9 
UCBRF_10	equ	0xA0		; USCI First Stage Modulation: A 
UCBRF_11	equ	0xB0		; USCI First Stage Modulation: B 
UCBRF_12	equ	0xC0		; USCI First Stage Modulation: C 
UCBRF_13	equ	0xD0		; USCI First Stage Modulation: D 
UCBRF_14	equ	0xE0		; USCI First Stage Modulation: E 
UCBRF_15	equ	0xF0		; USCI First Stage Modulation: F 

