mikeakohn/naken_asm/include/msp430_old/msp430g2553.inc
UCBRS_0		equ	0x00		; USCI Second Stage Modulation: 0 
UCBRS_1		equ	0x02		; USCI Second Stage Modulation: 1 
UCBRS_2		equ	0x04		; USCI Second Stage Modulation: 2 
UCBRS_3		equ	0x06		; USCI Second Stage Modulation: 3 
UCBRS_4		equ	0x08		; USCI Second Stage Modulation: 4 
UCBRS_5		equ	0x0A		; USCI Second Stage Modulation: 5 
UCBRS_6		equ	0x0C		; USCI Second Stage Modulation: 6 
UCBRS_7		equ	0x0E		; USCI Second Stage Modulation: 7 

UCLISTEN	equ	0x80		; USCI Listen mode 
UCFE		equ	0x40		; USCI Frame Error Flag 
UCOE		equ	0x20		; USCI Overrun Error Flag 
UCPE		equ	0x10		; USCI Parity Error Flag 
UCBRK		equ	0x08		; USCI Break received 
UCRXERR		equ	0x04		; USCI RX Error Flag 
UCADDR		equ	0x02		; USCI Address received Flag 
UCBUSY		equ	0x01		; USCI Busy Flag 
UCIDLE		equ	0x02		; USCI Idle line detected Flag 

;			0x80		; reserved 
;			0x40		; reserved 
;			0x20		; reserved 
;			0x10		; reserved 
UCNACKIE	equ	0x08		; NACK Condition interrupt enable 
UCSTPIE		equ	0x04		; STOP Condition interrupt enable 
UCSTTIE		equ	0x02		; START Condition interrupt enable 
UCALIE		equ	0x01		; Arbitration Lost interrupt enable 

UCSCLLOW	equ	0x40		; SCL low 
UCGC		equ	0x20		; General Call address received Flag 
UCBBUSY		equ	0x10		; Bus Busy Flag 
UCNACKIFG	equ	0x08		; NAK Condition interrupt Flag 
UCSTPIFG	equ	0x04		; STOP Condition interrupt Flag 
UCSTTIFG	equ	0x02		; START Condition interrupt Flag 
UCALIFG		equ	0x01		; Arbitration Lost interrupt Flag 

UCIRTXPL5	equ	0x80		; IRDA Transmit Pulse Length 5 
UCIRTXPL4	equ	0x40		; IRDA Transmit Pulse Length 4 
UCIRTXPL3	equ	0x20		; IRDA Transmit Pulse Length 3 
UCIRTXPL2	equ	0x10		; IRDA Transmit Pulse Length 2 
UCIRTXPL1	equ	0x08		; IRDA Transmit Pulse Length 1 
UCIRTXPL0	equ	0x04		; IRDA Transmit Pulse Length 0 
UCIRTXCLK	equ	0x02		; IRDA Transmit Pulse Clock Select 
UCIREN		equ	0x01		; IRDA Encoder/Decoder enable 

UCIRRXFL5	equ	0x80		; IRDA Receive Filter Length 5 
UCIRRXFL4	equ	0x40		; IRDA Receive Filter Length 4 
UCIRRXFL3	equ	0x20		; IRDA Receive Filter Length 3 
UCIRRXFL2	equ	0x10		; IRDA Receive Filter Length 2 
UCIRRXFL1	equ	0x08		; IRDA Receive Filter Length 1 
UCIRRXFL0	equ	0x04		; IRDA Receive Filter Length 0 
UCIRRXPL	equ	0x02		; IRDA Receive Input Polarity 
UCIRRXFE	equ	0x01		; IRDA Receive Filter enable 

;			0x80		; reserved 
;			0x40		; reserved 
UCDELIM1	equ	0x20		; Break Sync Delimiter 1 
UCDELIM0	equ	0x10		; Break Sync Delimiter 0 
UCSTOE		equ	0x08		; Sync-Field Timeout error 
UCBTOE		equ	0x04		; Break Timeout error 
;			0x02		; reserved 
UCABDEN		equ	0x01		; Auto Baud Rate detect enable 

UCGCEN		equ	0x8000		; I2C General Call enable 
UCOA9		equ	0x0200		; I2C Own Address 9 
UCOA8		equ	0x0100		; I2C Own Address 8 
UCOA7		equ	0x0080		; I2C Own Address 7 
UCOA6		equ	0x0040		; I2C Own Address 6 
UCOA5		equ	0x0020		; I2C Own Address 5 
UCOA4		equ	0x0010		; I2C Own Address 4 
UCOA3		equ	0x0008		; I2C Own Address 3 
UCOA2		equ	0x0004		; I2C Own Address 2 
UCOA1		equ	0x0002		; I2C Own Address 1 
UCOA0		equ	0x0001		; I2C Own Address 0 

UCSA9		equ	0x0200		; I2C Slave Address 9 
UCSA8		equ	0x0100		; I2C Slave Address 8 
UCSA7		equ	0x0080		; I2C Slave Address 7 
UCSA6		equ	0x0040		; I2C Slave Address 6 
UCSA5		equ	0x0020		; I2C Slave Address 5 
UCSA4		equ	0x0010		; I2C Slave Address 4 
UCSA3		equ	0x0008		; I2C Slave Address 3 
UCSA2		equ	0x0004		; I2C Slave Address 2 
UCSA1		equ	0x0002		; I2C Slave Address 1 
UCSA0		equ	0x0001		; I2C Slave Address 0 

;;;
;;; WATCHDOG TIMER
;;;

#define __MSP430_HAS_WDT__		; Definition to show that Module is available 

WDTCTL		equ	0x0120		; Watchdog Timer Control 

; The bit names have been prefixed with "WDT" 
WDTIS0		equ	0x0001	
WDTIS1		equ	0x0002	
WDTSSEL		equ	0x0004	
WDTCNTCL	equ	0x0008	
WDTTMSEL	equ	0x0010	
WDTNMI		equ	0x0020	
WDTNMIES	equ	0x0040	
WDTHOLD		equ	0x0080	

WDTPW		equ	0x5A00	

; WDT-interval times [1ms] coded with Bits 0-2 
; WDT is clocked by fSMCLK assumed 1MHz 
WDT_MDLY_32	equ	WDTPW+WDTTMSEL+WDTCNTCL				; 32ms interval default 
WDT_MDLY_8	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTIS0			; 8ms	  " 
WDT_MDLY_0_5	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1			; 0.5ms	  " 
WDT_MDLY_0_064	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1+WDTIS0		; 0.064ms " 

; WDT is clocked by fACLK assumed 32KHz 
WDT_ADLY_1000	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL			; 1000ms  " 
WDT_ADLY_250	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS0		; 250ms	  " 
WDT_ADLY_16	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1		; 16ms	  " 
WDT_ADLY_1_9	equ	WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0	; 1.9ms	  " 

; Watchdog mode -> reset after expired time 
; WDT is clocked by fSMCLK assumed 1MHz 
WDT_MRST_32	equ	WDTPW+WDTCNTCL					; 32ms interval default 
WDT_MRST_8	equ	WDTPW+WDTCNTCL+WDTIS0				; 8ms	  " 
WDT_MRST_0_5	equ	WDTPW+WDTCNTCL+WDTIS1				; 0.5ms	  " 
WDT_MRST_0_064	equ	WDTPW+WDTCNTCL+WDTIS1+WDTIS0			; 0.064ms " 

; WDT is clocked by fACLK assumed 32KHz 
WDT_ARST_1000	equ	WDTPW+WDTCNTCL+WDTSSEL				; 1000ms  " 
WDT_ARST_250	equ	WDTPW+WDTCNTCL+WDTSSEL+WDTIS0			; 250ms	  " 
WDT_ARST_16	equ	WDTPW+WDTCNTCL+WDTSSEL+WDTIS1			; 16ms	  " 
WDT_ARST_1_9	equ	WDTPW+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0		; 1.9ms	  " 

; INTERRUPT CONTROL 
; These two bits are defined in the Special Function Registers 
; WDTIE   0x01 
; WDTIFG  0x01 

;;;
;;; Calibration Data in Info Mem
;;;

CALDCO_16MHZ	equ	0x10F8		; DCOCTL  Calibration Data for 16MHz 
CALBC1_16MHZ	equ	0x10F9		; BCSCTL1 Calibration Data for 16MHz 
CALDCO_12MHZ	equ	0x10FA		; DCOCTL  Calibration Data for 12MHz 
CALBC1_12MHZ	equ	0x10FB		; BCSCTL1 Calibration Data for 12MHz 
CALDCO_8MHZ	equ	0x10FC		; DCOCTL  Calibration Data for 8MHz 
CALBC1_8MHZ	equ	0x10FD		; BCSCTL1 Calibration Data for 8MHz 
CALDCO_1MHZ	equ	0x10FE		; DCOCTL  Calibration Data for 1MHz 
CALBC1_1MHZ	equ	0x10FF		; BCSCTL1 Calibration Data for 1MHz 


;;;
;;; Interrupt Vectors offset from 0xFFE0
;;;

PORT1_VECTOR		equ	0x0004		; 0xFFE4 Port 1 
PORT2_VECTOR		equ	0x0006		; 0xFFE6 Port 2 
ADC10_VECTOR		equ	0x000A		; 0xFFEA ADC10 
USCIAB0TX_VECTOR	equ	0x000C		; 0xFFEC USCI A0/B0 Transmit 
USCIAB0RX_VECTOR	equ	0x000E		; 0xFFEE USCI A0/B0 Receive 
TIMER0_A1_VECTOR	equ	0x0010		; 0xFFF0 Timer0A CC1, TA0 
TIMER0_A0_VECTOR	equ	0x0012		; 0xFFF2 Timer0_A CC0 
WDT_VECTOR		equ	0x0014		; 0xFFF4 Watchdog Timer 
COMPARATORA_VECTOR	equ	0x0016		; 0xFFF6 Comparator A 
TIMER1_A1_VECTOR	equ	0x0018		; 0xFFF8 Timer1_A CC1-4, TA1 
TIMER1_A0_VECTOR	equ	0x001A		; 0xFFFA Timer1_A CC0 
NMI_VECTOR		equ	0x001C		; 0xFFFC Non-maskable 
RESET_VECTOR		equ	0x001E		; 0xFFFE Reset [Highest Priority] 

;;;
;;; End of Modules
;;;
